{
    "Headers": {
        "L": "# License: ",
        "V": "### Version: ",
        "LF": "## License Family: ",
        "LN": "## License Name: ",
        "C": "### Code: ",
        "P": "### Publication: ",
        "CR": "### License Creator: ",
        "CC": "### License Creator Contact: ",
        "LP": "## Licenses Provisions\n\n",
        "P1": "### Permissions\n\n",
        "C1": "### Conditions\n\n",
        "L1": "### Limitations\n\n",
        "CP": "## Categories of Provisions\n\n",
        "CPP": "### Permissions\n\n#### What you are allowed to do\n\n- [Commercial Use](#Commercial_Use)\n- [Donation](#Donation)\n- [Distribution](#Distribution)\n- [Modification](#Modification)\n- [Private Use](#Private_Use)\n- [Patent Use](#Patent_Use)\n- [Distribution Final Form](#Distribution_Final)\n- [Upgradability](#Upgradability)\n- [Multi-Licensing](#ML)\n- [Trademark Use](#TU)\n\n",
        "CPC": "### ### Conditions\n\n#### What rules you must conform to\n\n- [Disclose Source](#Disclose_Source)\n- [License and Copyright Notice](#License_and_Copyright_Notice)\n- [License and Copyright Notice For Source](#License_and_Copyright_Notice_Source)\n- [Network Use Is Distribution](#Network_Use_Is_Distribution)\n- [Same License](#Same_License)\n- [Existing File Same License](#Existing_File_Same_License)\n- [Lesser Same License](#Lesser_Same_License)\n- [State Changes](#State_Changes)\n- [Hide Source](#Hide_Source)\n- [Contributor License Agreement](#CLA)\n\n",
        "CPL": "### Limitations\n\n#### Protection for the creators\n\n- [Liability](#Liability)\n- [Warranty](#Warranty)\n- [No Patent Use](#NPU)\n- [No Trademark Use](#NTU)\n\n",
        "D": "---\n\n## Disclaimer\n\n",
        "P2": "## Provisions\n\n",
        "C2": "## Codes\n\n",
        "LG": "## License Generation Details\n\n",
        "LC": "### License Collection: ",
        "V1": "### Version: ",
        "P3": "### Publication: ",
        "LCR": "### Collection Creator: ",
        "LCS": "### Collection Creator Contact: "
    },
    "Provision Headers": {
        "C": "<h3 id=\"Commercial_Use\">Commercial Use</h3>\n\n",
        "Do": "<h3 id=\"Donation\">Donation</h3>\n\n",
        "D": "<h3 id=\"Distribution\">Distribution</h3>\n\n",
        "M": "<h3 id=\"Modification\">Modification</h3>\n\n",
        "Pr": "<h3 id=\"Private_Use\">Private Use</h3>\n\n",
        "Pa": "<h3 id=\"Patent_Use\">Patent Use</h3>\n\n",
        "Df": "<h3 id=\"Distribution_Final\">Distribution Final Form</h3>\n\n",
        "U": "<h3 id=\"Upgradability\">Upgradability</h3>\n\n",
        "Ml": "<h3 id=\"ML\">Multi-Licensing</h3>\n\n",
        "T": "<h3 id=\"TU\">Trademark Use</h3>\n\n",
        "Ds": "<h3 id=\"Disclose_Source\">Disclose Source</h3>\n\n",
        "Lc": "<h3 id=\"License_and_Copyright_Notice\">License and Copyright Notice</h3>\n\n",
        "Lcs": "<h3 id=\"License_and_Copyright_Notice_Source\">License and Copyright Notice For Source</h3>\n\n",
        "N": "<h3 id=\"Network_Use_Is_Distribution\">Network Use Is Distribution</h3>\n\n",
        "Sl": "<h3 id=\"Same_License\">Same License</h3>\n\n",
        "Sle": "<h3 id=\"Existing_File_Same_License\">Existing File Same License</h3>\n\n",
        "Ls": "<h3 id=\"Lesser_Same_License\">Lesser Same License</h3>\n\n",
        "S": "<h3 id=\"State_Changes\">State Changes</h3>\n\n",
        "H": "<h3 id=\"Hide_Source\">Hide Source</h3>\n\n",
        "Cl": "<h3 id=\"CLA\">Contributor License Agreement</h3>\n\n",
        "L": "<h3 id=\"Liability\">Liability</h3>\n\n",
        "W": "<h3 id=\"Warranty\">Warranty</h3>\n\n",
        "Pn": "<h3 id=\"NPU\">No Patent Use</h3>\n\n",
        "Tn": "<h3 id=\"NTU\">No Trademark Use</h3>\n\n"
    },
    "Content": {
        "Disclaimer": "Any contributor to this project automatically agrees irrevocably and perpetually to license their contribution and copyrighted material under the current license of this project at time of contribution.\n\nAny changes to the license are not retroactive and will only affect future releases and contributions. All previous contributions are still available under the license the contributor and copyright owner agreed to at the time of contributions.\n\nOnly those provisions marked above as being included, or contained, in this license are part of this license. All provisions not marked above as being included, or contained, are to be disregarded.\n\n",
        "Codes": "The code for the license is set up in the following sections:\n\n1. License Initialism\n2. Permissions\n3. Conditions\n4. Limitations\n\nThe code is built in the following format:\n\n- 1-[2a-2b-2n]-[3a-3b-3n]-[4a-4b]\n\n| Permission | Code |\n|---|---|\n| Commercial Use | C |\n| Donation | Do |\n| Distribution | D |\n| Modification | M |\n| Private Use | Pr |\n| Patent Use | Pa |\n| Distribution Final Form | Df |\n| Upgradability | U |\n| Multi-Licensing | Ml |\n| Trademark Use | T |\n\n| Condition | Code |\n|---|---|\n| Disclose Source | Ds |\n| License and Copyright Notice | Lc |\n| License and Copyright Notice For Source | Lcs |\n| Network Use Is Distribution | N |\n| Same License | Sl |\n| Existing File Same License | Sle |\n| Lesser Same License | Ls |\n| State Changes | S |\n| Hide Source | H |\n| Contributor License Agreement | Cl |\n\n| Limitation | Code |\n|---|---|\n| Liability | L |\n| Warranty | W |\n| No Patent Use | Pn |\n| No Trademark Use | Tn |\n\n",
        "License Generation": "The contents above this section pertain to the project as a whole and the license that it follows.\n\nThe following section pertains only to the generation of the license itself. It does not pertain to the project as a whole or the license it follows.\n\n",
        "License Generation Text": "Everyone is permitted to generate their own licenses using these provisions verbatim but are not allowed to change the provisions while using the name or referencing \"[<u>License Collection</u>]\" and \"[<u>License Creator</u>]\".\n\nIf any and all references to \"[<u>License Collection</u>]\" and \"[<u>License Creator</u>]\" are removed everyone is permitted to modify, copy, distribute, publish, and use this license without restriction.\n\nThe creator of this license, and/or license collection, shall in no event be held liable and/or held responsible for any claim or damage. This license is provided as is without warranty of any kind, whether expressed or implied.\n\n",
        "Do": "\"Donation\" allows for the providers of a product or service using this project to collect donations. These donations can be monetary or applicable transactions such as, but not limited to, labor, advertising, or services.\n\nA donation must not be required from the customer, consumer, end user, or entity to use the provided product or service using this project. A donation must also not give the customer, consumer, end user, or entity special privileges or access to the product or service using this project that a non-donator would not have. Simply put, donators and non-donators must be kept equal in all aspects.\n\n",
        "D": "\"Distribution\" means that the project may be distributed to others. This includes physical, digital, network, and any other form of distribution, including those yet to be created.\n\n\"Distribution\" is explicitly implied for every form of this project, this includes, but is not limited to, its raw form (such as source code), its finished form (such as binaries, executables, compiled forms, etc.), it's remote form (such as a website, hosted, cloud, as a service versions, or live service versions), and anything in between, or yet to be created.\n\n\"Raw forms\" being any forms that the customer, consumer, end user, or entity can use to build another form, usually the finished form.\n\n\"Finished forms\" being any forms that are given to the customer, consumer, end user, or entity in their entire, full, or complete forms.\n\n\"Remote forms\" being any forms that provide a customer, consumer, end user, or entity access, without necessarily giving the full work in a complete physical, digital, or other form.\n\nThis also specifically includes having **multiple** users of the project. Such as a piece of hosted software that multiple users connect to over networks.\n\nUnless the \"Network Use Is Distribution\" special provision is explicitly granted being \"over a network\" does not count as \"Distribution\" in regard to the \"Disclose Source\" and \"License and Copyright Notice\" provisions. Meaning that any \"over a network\" are not subject to the \"Disclose Source\" and \"License and Copyright Notice\" provisions if the \"Network Use Is Distribution\" special provision is not explicitly granted.\n\n",
        "M": "\"Modification\" means that this project, and its constituent parts, may be changed or edited. This includes every element of the project. If modification is not explicitly allowed this project must be used as is.\n\nAny other project used in this project is subject to the provisions of its license. Therefore, there are two exceptions to this provision:\n\n1. If modification is not explicitly allowed in this project but an included project has a license allowing for modification then the items of this project from that project can be modified according to its license.\n\n2. If modification is explicitly allowed in this project but an included project has a license not allowing for modification then the items of this project from that project cannot be modified according to its license.\n\n",
        "Pr": "\"Private Use\" entails using the project for personal use. \"Personal Use\" meaning you are the **sole** user of the project. Specifically, that there is a sole user of this distinct distribution, version or copy of the project at any given time.\n\nHowever, if using a local device, or version, of the project multiple users can use the project independently. Seeing as it's no different than if they were using their own version or borrowing yours. This does not allow for distributing the project; that needs to be explicitly allowed in another provision.\n\nAn exception to the sole user rule is if the project requires or facilitates multiple users on a local device, or version, of the project. Such as, if a video game has local co-op. In that scenario the project can be used for \"private use\" by multiple users. Seeing as the other user does not get distributed a version, or copy, of the product to keep as their own. It was your local distribution, version, or copy of the project the entire time.\n\n\"Private Use\" is analogous to having a hammer. If I have a hammer, I can use it to hammer nails. If my friend comes over, they can pick up my hammer and hammer nails as well, but then I can't use the hammer anymore. \"Distribution\" is also analogous to me having a hammer. Except, when my friend comes over instead of me letting him use my hammer, I duplicate the hammer and give him the duplicate. Then we both have hammers and can hammer nails.\n\n",
        "Pa": "When a contributor uses patent rights and claims that they hold in this project they grant everyone using this project the right to use those patent rights and claims in this project, and its derivatives, as well.\n\n",
        "Df": "\"Distribution Final Form\" is a special form of distribution that means that the project may be distributed to others only in its final forms.\n\n\"Distribution Final Form\" is explicitly implied for every final form of this project, this includes, but is not limited to, it's finished form (such as binaries, executables, compiled forms, etc.), and it's remote form (such as a website, hosted, cloud, as a service versions, or live service versions). This provision explicitly doesn't allow distribution in the raw forms (such as source code).\n\n\"Raw forms\" being any forms that the customer, consumer, end user, or entity can use to build another form, usually the finished form.\n\n\"Finished forms\" being any forms that are given to the customer, consumer, end user, or entity in their entire, full, or complete forms.\n\n\"Remote forms\" being any forms that provide a customer, consumer, end user, or entity access, without necessarily giving the full work in a complete physical, digital, or other form.\n\nThis also specifically includes having **multiple** users of the project. Such as a piece of hosted software that multiple users connect to over networks.\n\nUnless the \"Network Use Is Distribution\" special provision is explicitly granted being \"over a network\" does not count as \"Distribution\" in regard to the \"Disclose Source\" and \"License and Copyright Notice\" provisions. Meaning that any \"over a network\" are not subject to the \"Disclose Source\" and \"License and Copyright Notice\" provisions if the \"Network Use Is Distribution\" special provision is not explicitly granted.\n\n",
        "U": "\"Upgradability\" means that in the event that a new version of this license is released by the same person, foundation, or company that authored it the project has the choice, but are not required, to change or upgrade the license of this project to the new version.\n\nIn order to upgrade the license all copyright owners must agree to upgrade the version of the license, unless they've all agreed on another way to decide, such as a majority vote, an agreed upon lead decision maker of the project, or all contributors having a Contributor License Agreement with the project.\n\n",
        "Ml": "\"Multi-Licensing\" means that it is possible to release this project under multiple differing licenses and versions. Such as a Community version and a Commercial version.\n\nIn order to for multi-licensing to be enacted all copyright owners must agree to the multi-licensing and what licenses to use or change to, unless they've all agreed on another way to decide, such as a majority vote, an agreed upon lead decision maker of the project, or all contributors having a Contributor License Agreement with the project.\n\n",
        "T": "This license grants permission to use names, trade names, trademarks, service marks, product marks, and/or logos of the Licensor and/or Contributors to endorse or promote creations derived from this project in regard to names, trade names, trademarks, service marks, product marks, and/or logos used in relation to this project and its derivatives.\n\n",
        "Ds": "\"Disclose Source\" means that when the project is distributed the source code must be made available.\n\nIn the event that the entire source code is not distributed alongside the form distributed to the end user they must be made aware, in some easily visible and navigable way, that they are entitled access to it, as well as where they can freely, easily, and readily receive it.\n\nThis \"easily visible and navigable way\" can be any method that meshes well with your use case. It should be in such a way that the customer, consumer, end user, or entity using your product or service is made readily aware that the source code is available if they desire it. Some, but not all, examples of this are as follows: Part of a splash screen, prominent in the documentation or manual, an easily navigable page on a website, and a notice message confirmed by the user. How this source code is made available is up to your discretion. The preferred method would be to have it available to download from a public source.\n\n",
        "Lc": "\"License and Copyright Notice\" means that the following should be included when this project is distributed:\n\n- A copy of this license.\n- A mention of this project, the license it uses, and any other desired relevant information, such as the person, foundation, or company that leads the project.\n\nIn the event that this project is distributed in its raw form, such as source code, these two items should be included as files.\n\nIn the event that the project is distributed in its finished form, such as binaries, these two items should be included alongside the finished form or located in the finished form in an easy to discover and navigate area for the end user.\n\nIn the event that this project is remote, such as a website, these two items should be located in the finished form in an easy to discover and navigate area for the end user.\n\nPreferably, but not required, inside each file of the source code would be a header comment listing information about the copyright and the license. How this is implemented would be up to you. An example would be:\n\n---\n\nThis file is part of [<u>Project Name</u>] [(<u>link to website, source code, or repository</u>)].\n\nCopyright (c) [<u>Year/Month/Date</u>] [<u>File Creator Name, Foundation Name, or Company Name</u>]\n\nThis program is under the terms of the [<u>License Name</u>].\n\nYou should have received a copy of the [<u>License Name</u>] along with this program. If not, see [(<u>link to the license</u>)].\n\n[<u>Small description about what this project does</u>]\n\n[<u>Small description about what this file does</u>]\n\n---\n\nPreferably, but not required, would be two other items included alongside the required other two:\n\n1. Mentions to any and all other projects used within this project, the license they use, and any other desired relevant and/or required information about them.\n\t- It is respectful to give credit to the projects that you used to create your project.\n\t- Given that many projects have licenses requiring this information to be recorded it is always a good idea to include this information.\n\n2. Information about every author, copyright holder, maintainer, or any other party who modifies the project, such as their name, contact information, and what they did on the project.\n\t- It is of upmost importance to give credit to the creators and maintainers of what you use.\n\t- It would also be respectful not to include those who don't want their information published.\n\t- However, due to the large and collaborative nature of many open-source projects this may not, and often will not, be feasible. In that case it would be respectful to at least give references to the key figures and the community in general.\n\nIf it is too cumbersome to add these two additional items the commit history, or similar concept, from a source control system, such as git, is acceptable. However, dedicated items would be preferred as the end-user will often not have access to the source control system or they simply wouldn't understand how to navigate it.\n\n",
        "Lcs": "\"License and Copyright Notice For Source\" means that the following should be included when this project's source code is distributed:\n\n- A copy of this license.\n- A mention of this project, the license it uses, and any other desired relevant information, such as the person, foundation, or company that leads the project.\n\nThese two items should be included as files.\n\n\n\nPreferably, but not required, inside each file of the source code would be a header comment listing information about the copyright and the license. How this is implemented would be up to you. An example would be:\n\n---\n\nThis file is part of [<u>Project Name</u>] [(<u>link to website, source code, or repository</u>)].\n\nCopyright (c) [<u>Year/Month/Date</u>] [<u>File Creator Name, Foundation Name, or Company Name</u>]\n\nThis program is under the terms of the [<u>License Name</u>].\n\nYou should have received a copy of the [<u>License Name</u>] along with this program. If not, see [(<u>link to the license</u>)].\n\n[<u>Small description about what this project does</u>]\n\n[<u>Small description about what this file does</u>]\n\n---\n\nPreferably, but not required, would be two other items included alongside the required other two:\n\n1. Mentions to any and all other projects used within this project, the license they use, and any other desired relevant and/or required information about them.\n\t- It is respectful to give credit to the projects that you used to create your project.\n\t- Given that many projects have licenses requiring this information to be recorded it is always a good idea to include this information.\n\n2. Information about every author, copyright holder, maintainer, or any other party who modifies the project, such as their name, contact information, and what they did on the project.\n\t- It is of upmost importance to give credit to the creators and maintainers of what you use.\n\t- It would also be respectful not to include those who don't want their information published.\n\t- However, due to the large and collaborative nature of many open-source projects this may not, and often will not, be feasible. In that case it would be respectful to at least give references to the key figures and the community in general.\n\nIf it is too cumbersome to add these two additional items the commit history, or similar concept, from a source control system, such as git, is acceptable. However, dedicated items would be preferred as the end-user will often not have access to the source control system or they simply wouldn't understand how to navigate it.\n\n",
        "N": "\"Network Use Is Distribution\" means that when a customer, consumer, end user, or entity uses, or interacts with, this project over a network it is treated as distribution. \"Over a network\" meaning any form of remote connection, including forms yet to be created. These remote connections include, but are not limited to, websites, servers, the cloud, and as a service. Any form that exists to provide a customer, consumer, end user, or entity access without having to provide the entire or full work in a complete physical, digital, or other form.\n\nThis provision is a special provision that adds additional context to the \"Distribution\" and \"Distribution Final Form\" provisions. Unless this provision is explicitly granted being \"over a network\" does not count as \"Distribution\". Meaning that any \"over a network\" activities would not count as \"Distribution\" and not be subject to the \"Disclose Source\" and \"License and Copyright Notice\" provisions if this provision is not explicitly granted.\n\n",
        "Sl": "\"Same License\" means that when using this project your **entire** project must use this license.\n\n\"Using this project\" means:\n\n- Using this project as is.\n- Using this project as a component or derivative work.\n\t- Using as a component or derivative work includes use cases such as a library, package, module, framework, platform, etc, in a new project.\n- Making modifications to this project.\n\t- Modifications are any actions that involve addition, deletion, and/or changing of the contents from the original project.\n\nIf other projects were also used as components in your project, follow these rules:\n\n1. If their license satisfies the provisions of this license:\n\t1. If they allow permissible licenses to be used then use this license. While retaining a copy of the other projects' original license alongside it's files if required.\n\t2. If they don't allow for permissible licenses then either remove the other project as a component of your project or remove this project as a component of your project. This license must be used for the entirety of your project. If the other project's license does not allow for permissible licenses, it cannot be used in your project alongside this project, even if the two licenses satisfy each other's provisions.\n2. If their license does not satisfy the provisions of this license:\n\t1. Remove the other project as a component of your project or remove this project as a component of your project. Both projects cannot be used if they don't share the same license provisions.\n\n",
        "Sle": "\"Existing File Same License\" means that when using this project your project must use the same license, but only for the original and/or modified content of this project.\n\n\"Using this project\" means:\n\n- Using this project as is.\n- Using this project as a component or derivative work.\n\t- Using as a component or derivative work includes use cases such as a library, package, module, framework, platform, etc, in a new project.\n- Making modifications to this project.\n\t- Modifications are any actions that involve addition, deletion, and/or changing of the contents from the original project.\n\nIf other projects were also used as components in your project, it's important that their license does not require your entire project to use their license. For this project to be used in your project it must be allowed to keep its license.\n\n",
        "Ls": "\"Lesser Same License\" means that when using this project your project must use the same license, but only for the original and/or modified content of this project, and creations derived from the original content.\n\nIn this context created or derived means building upon this project directly. Not using or calling this project inside of your project.\n\t- Adding a new function, interface, component, classes, etc. to this project that builds upon this project would count as being created or derived in this context.\n\t- Calling functions, interfaces, components, classes, etc. from this project from somewhere else in your project would not count as being created or derived in this context.\n\n\"Using this project\" means:\n\n- Using this project as is.\n- Using this project as a component or derivative work.\n\t- Using as a component or derivative work includes use cases such as a library, package, module, framework, platform, etc, in a new project.\n- Making modifications to this project.\n\t- Modifications are any actions that involve addition, deletion, and/or changing of the contents from the original project.\n\nIf other projects were also used as components in your project, it's important that their license does not require your entire project to use their license. For this project to be used in your project it must be allowed to keep its license.\n\n",
        "S": "\"State Changes\" requires that any changes made to the project must be documented. The method to document these changes should be stored with the source code.\n\nPreferably, this documentation would be stored in the source code itself. The verbose approach would be adding the date, author of the modification, if desired contact information, and if desired comment explaining the modification to sections modified. The brief approach would be to make an addition to a header comment, or add a comment by the changes, including the date, the author of the modification, if desired contact information, and if desired a comment about the modification. An example section added to the header comment is:\n\n---\n\nChanges to this file have been made as follows:\n\n[<u>Year/Month/Day</u>] [<u>Author Name</u>] [<u>Brief description of the change</u>].\n\n---\n\nVersion control will be accepted but is not preferred. This is because it can easily be separated from the source code itself. An end user downloading the source code will likely not clone the repository and thus not have access to the commit history of modifications.\n\nAnother approach would be a dedicated document listing the modification information. However, this is the most intensive for the maintainers and is not expected.\n\n",
        "H": "\"Hide Source\" means that when the project is distributed the source code must **NOT** be made available or included.\n\n",
        "Cl": "By contributing to this project, you agree to a \"Contributor License Agreement\". This license consists of the following:\n\n1. Granting irrevocable and perpetual rights to the Project Owner, Foundation, or Entity to make and distribute copies of your contributions to this project.\n2. Granting irrevocable and perpetual rights to the Project Owner, Foundation, or Entity to create and distribute collective works and derivative works of any contribution to this project.\n3. Granting the above irrevocable and perpetual rights to the Project Owner, Foundation, or Entity under any license decided by them.\n\nThe contributor should also identify their contributions to the project in the source code by adding the following comment to their contributions:\n\n---\n\nChanges to this file have been made as follows:\n\n[<u>Year/Month/Day</u>] [<u>Author Name</u>] Licensed to [<u>Project Name</u>] under a Contributor License Agreement. [<u>Brief description of the change</u>].\n\n---\n\n",
        "L": "\"Liability\" means as follows:\n\nIn no event shall the authors, copyright holders, maintainers, or any other party who modifies the project, and/or conveys the project as permitted above be liable and/or held responsible for any claim, damages, including any general, special, incidental, or consequential damages arising from the project, or other liability, whether in action of contract, tort or otherwise, arising from, out of, or in connection with the project, or other dealings of the project, even if the holder or other party has been advised of the possibility of such damages.\n\n",
        "W": "\"Warranty\" means as follows:\n\nThis project is provided as is without warranty of any kind, either expressed or implied. This includes, but is not limited to, warranties of merchantability and fitness for a particular purpose. The entirety of risk, including but not limited to, quality and performance of the project is entirely with you. Should any problems or damages arise you assume all costs in connection with this project or its use.\n\n",
        "Pn": "This license does not grant permission to use patents of the Licensor and/or Contributors unless explicitly given permission.\n\n",
        "Tn": "This license does not grant permission to use names, trade names, trademarks, service marks, product marks, and/or logos of the Licensor and/or Contributors to endorse or promote creations derived from this project without their explicit permission.\n\n"
    }
}